Model: "keyword_marvin_v3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 98, 40)               0         
_________________________________________________________________
svdf_1 (Svdf)                (1, 87, 32)               7172      
_________________________________________________________________
svdf_2 (Svdf)                (1, 76, 32)               6500      
_________________________________________________________________
svdf_3 (Svdf)                (1, 65, 32)               6500      
_________________________________________________________________
svdf_4 (Svdf)                (1, 34, 32)               2080      
_________________________________________________________________
svdf_5 (Svdf)                (1, 3, 32)                2080      
_________________________________________________________________
stream (Stream)              (1, 96)                   0         
_________________________________________________________________
dropout (Dropout)            (1, 96)                   0         
_________________________________________________________________
dense_8 (Dense)              (1, 3)                    291       
=================================================================
Total params: 24,623
Trainable params: 24,623
Non-trainable params: 0
_________________________________________________________________