{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 320], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_audio"}, "name": "input_audio", "inbound_nodes": []}, {"class_name": "SpeechFeatures", "config": {"name": "speech_features", "trainable": true, "dtype": "float32", "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "use_tf_fft": false, "inference_batch_size": 1, "preemph": 0.0, "window_type": "hann", "frame_size_ms": 40.0, "frame_step_ms": 20.0, "mel_num_bins": 80, "mel_lower_edge_hertz": 20.0, "mel_upper_edge_hertz": 7000, "log_epsilon": 1e-12, "sample_rate": 16000.0, "noise_scale": 0.0, "fft_magnitude_squared": false, "dct_num_features": 40, "mean": null, "stddev": null}, "name": "speech_features", "inbound_nodes": [[["input_audio", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_1", "trainable": true, "dtype": "float32", "memory_size": 4, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_1", "inbound_nodes": [[["speech_features", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_2", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_2", "inbound_nodes": [[["svdf_1", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_3", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_3", "inbound_nodes": [[["svdf_2", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_4", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_4", "inbound_nodes": [[["svdf_3", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_5", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_5", "inbound_nodes": [[["svdf_4", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_6", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": -1, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_6", "inbound_nodes": [[["svdf_5", 0, 0, {}]]]}, {"class_name": "Stream", "config": {"name": "stream", "trainable": true, "dtype": "float32", "inference_batch_size": 1, "mode": "STREAM_EXTERNAL_STATE_INFERENCE", "pad_time_dim": false, "cell": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "__passive_serialization__": true}, "state_shape": [1, 1, 256]}, "name": "stream", "inbound_nodes": [[["svdf_6", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 640], "dtype": "float32", "sparse": false, "ragged": false, "name": "data_frame_4input_state"}, "name": "data_frame_4input_state", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 4, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_24input_state"}, "name": "depthwise_conv1d_24input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_37", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_37", "inbound_nodes": [[["speech_features", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 10, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_25input_state"}, "name": "depthwise_conv1d_25input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_38", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_38", "inbound_nodes": [[["svdf_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 10, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_26input_state"}, "name": "depthwise_conv1d_26input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_39", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_39", "inbound_nodes": [[["svdf_2", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 10, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_27input_state"}, "name": "depthwise_conv1d_27input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_40", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_40", "inbound_nodes": [[["svdf_3", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 10, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_28input_state"}, "name": "depthwise_conv1d_28input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_41", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_41", "inbound_nodes": [[["svdf_4", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 10, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "depthwise_conv1d_29input_state"}, "name": "depthwise_conv1d_29input_state", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_42", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoBeHIBAAAAcgEAAAD6Ti9ob21l\nL3Rob3JpdXMvRG9jdW1lbnRzL1Jlc2VhcmNoL2t3cy9Wb2ljZUNvbnRyb2wva3dzX3N0cmVhbWlu\nZy9sYXllcnMvc3ZkZi5wedoIPGxhbWJkYT5OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "kws_streaming.layers.svdf", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_42", "inbound_nodes": [[["svdf_5", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "stream/input_state"}, "name": "stream/input_state", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["stream", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/speech_features/data_frame_4/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/speech_features/data_frame_4/strided_slice", "op": "StridedSlice", "input": ["streaming_3/speech_features/data_frame_4input_state", "streaming_3/speech_features/data_frame_4/strided_slice/stack", "streaming_3/speech_features/data_frame_4/strided_slice/stack_1", "streaming_3/speech_features/data_frame_4/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, "constants": {"1": [0, 320], "2": [0, 640], "3": [1, 1]}}, "name": "tf_op_layer_streaming_3/speech_features/data_frame_4/strided_slice", "inbound_nodes": [[["data_frame_4input_state", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_1/depthwise_conv1d_24/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_1/depthwise_conv1d_24/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_1/depthwise_conv1d_24/depthwise_conv1d_24input_state", "streaming_3/svdf_1/depthwise_conv1d_24/strided_slice/stack", "streaming_3/svdf_1/depthwise_conv1d_24/strided_slice/stack_1", "streaming_3/svdf_1/depthwise_conv1d_24/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1, 0], "2": [0, 4, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_1/depthwise_conv1d_24/strided_slice", "inbound_nodes": [[["depthwise_conv1d_24input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["lambda_37", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_2/depthwise_conv1d_25/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_2/depthwise_conv1d_25/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_2/depthwise_conv1d_25/depthwise_conv1d_25input_state", "streaming_3/svdf_2/depthwise_conv1d_25/strided_slice/stack", "streaming_3/svdf_2/depthwise_conv1d_25/strided_slice/stack_1", "streaming_3/svdf_2/depthwise_conv1d_25/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 1, 0], "2": [0, 10, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_2/depthwise_conv1d_25/strided_slice", "inbound_nodes": [[["depthwise_conv1d_25input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_47", "inbound_nodes": [[["lambda_38", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_3/depthwise_conv1d_26/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_3/depthwise_conv1d_26/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_3/depthwise_conv1d_26/depthwise_conv1d_26input_state", "streaming_3/svdf_3/depthwise_conv1d_26/strided_slice/stack", "streaming_3/svdf_3/depthwise_conv1d_26/strided_slice/stack_1", "streaming_3/svdf_3/depthwise_conv1d_26/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1, 0], "2": [0, 10, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_3/depthwise_conv1d_26/strided_slice", "inbound_nodes": [[["depthwise_conv1d_26input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_49", "inbound_nodes": [[["lambda_39", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_4/depthwise_conv1d_27/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_4/depthwise_conv1d_27/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_4/depthwise_conv1d_27/depthwise_conv1d_27input_state", "streaming_3/svdf_4/depthwise_conv1d_27/strided_slice/stack", "streaming_3/svdf_4/depthwise_conv1d_27/strided_slice/stack_1", "streaming_3/svdf_4/depthwise_conv1d_27/strided_slice/stack_2"], "attr": {"end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 1, 0], "2": [0, 10, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_4/depthwise_conv1d_27/strided_slice", "inbound_nodes": [[["depthwise_conv1d_27input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_51", "inbound_nodes": [[["lambda_40", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_5/depthwise_conv1d_28/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_5/depthwise_conv1d_28/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_5/depthwise_conv1d_28/depthwise_conv1d_28input_state", "streaming_3/svdf_5/depthwise_conv1d_28/strided_slice/stack", "streaming_3/svdf_5/depthwise_conv1d_28/strided_slice/stack_1", "streaming_3/svdf_5/depthwise_conv1d_28/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [0, 1, 0], "2": [0, 10, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_5/depthwise_conv1d_28/strided_slice", "inbound_nodes": [[["depthwise_conv1d_28input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_53", "inbound_nodes": [[["lambda_41", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_6/depthwise_conv1d_29/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_6/depthwise_conv1d_29/strided_slice", "op": "StridedSlice", "input": ["streaming_3/svdf_6/depthwise_conv1d_29/depthwise_conv1d_29input_state", "streaming_3/svdf_6/depthwise_conv1d_29/strided_slice/stack", "streaming_3/svdf_6/depthwise_conv1d_29/strided_slice/stack_1", "streaming_3/svdf_6/depthwise_conv1d_29/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1, 0], "2": [0, 10, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/svdf_6/depthwise_conv1d_29/strided_slice", "inbound_nodes": [[["depthwise_conv1d_29input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_55", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_55", "inbound_nodes": [[["lambda_42", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/stream/strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/stream/strided_slice", "op": "StridedSlice", "input": ["streaming_3/stream/stream/input_state", "streaming_3/stream/strided_slice/stack", "streaming_3/stream/strided_slice/stack_1", "streaming_3/stream/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1, 0], "2": [0, 1, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_streaming_3/stream/strided_slice", "inbound_nodes": [[["stream/input_state", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/speech_features/data_frame_4/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/speech_features/data_frame_4/concat", "op": "ConcatV2", "input": ["streaming_3/speech_features/data_frame_4/strided_slice", "input_audio_3", "streaming_3/speech_features/data_frame_4/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/speech_features/data_frame_4/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/speech_features/data_frame_4/strided_slice", 0, 0, {}], ["input_audio", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_1/depthwise_conv1d_24/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_1/depthwise_conv1d_24/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_1/depthwise_conv1d_24/strided_slice", "streaming_3/svdf_1/dense_45/Tensordot", "streaming_3/svdf_1/depthwise_conv1d_24/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_1/depthwise_conv1d_24/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_1/depthwise_conv1d_24/strided_slice", 0, 0, {}], ["dense_45", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_2/depthwise_conv1d_25/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_2/depthwise_conv1d_25/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_2/depthwise_conv1d_25/strided_slice", "streaming_3/svdf_2/dense_47/Tensordot", "streaming_3/svdf_2/depthwise_conv1d_25/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_2/depthwise_conv1d_25/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_2/depthwise_conv1d_25/strided_slice", 0, 0, {}], ["dense_47", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_3/depthwise_conv1d_26/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_3/depthwise_conv1d_26/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_3/depthwise_conv1d_26/strided_slice", "streaming_3/svdf_3/dense_49/Tensordot", "streaming_3/svdf_3/depthwise_conv1d_26/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_3/depthwise_conv1d_26/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_3/depthwise_conv1d_26/strided_slice", 0, 0, {}], ["dense_49", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_4/depthwise_conv1d_27/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_4/depthwise_conv1d_27/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_4/depthwise_conv1d_27/strided_slice", "streaming_3/svdf_4/dense_51/Tensordot", "streaming_3/svdf_4/depthwise_conv1d_27/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_4/depthwise_conv1d_27/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_4/depthwise_conv1d_27/strided_slice", 0, 0, {}], ["dense_51", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_5/depthwise_conv1d_28/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_5/depthwise_conv1d_28/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_5/depthwise_conv1d_28/strided_slice", "streaming_3/svdf_5/dense_53/Tensordot", "streaming_3/svdf_5/depthwise_conv1d_28/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_5/depthwise_conv1d_28/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_5/depthwise_conv1d_28/strided_slice", 0, 0, {}], ["dense_53", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/svdf_6/depthwise_conv1d_29/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/svdf_6/depthwise_conv1d_29/concat", "op": "ConcatV2", "input": ["streaming_3/svdf_6/depthwise_conv1d_29/strided_slice", "streaming_3/svdf_6/dense_55/Tensordot", "streaming_3/svdf_6/depthwise_conv1d_29/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/svdf_6/depthwise_conv1d_29/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/svdf_6/depthwise_conv1d_29/strided_slice", 0, 0, {}], ["dense_55", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "streaming_3/stream/concat", "trainable": true, "dtype": "float32", "node_def": {"name": "streaming_3/stream/concat", "op": "ConcatV2", "input": ["streaming_3/stream/strided_slice", "streaming_3/svdf_6/Relu", "streaming_3/stream/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": 1}}, "name": "tf_op_layer_streaming_3/stream/concat", "inbound_nodes": [[["tf_op_layer_streaming_3/stream/strided_slice", 0, 0, {}], ["svdf_6", 0, 0, {}]]]}], "input_layers": [["input_audio", 0, 0], ["data_frame_4input_state", 0, 0], ["depthwise_conv1d_24input_state", 0, 0], ["depthwise_conv1d_25input_state", 0, 0], ["depthwise_conv1d_26input_state", 0, 0], ["depthwise_conv1d_27input_state", 0, 0], ["depthwise_conv1d_28input_state", 0, 0], ["depthwise_conv1d_29input_state", 0, 0], ["stream/input_state", 0, 0]], "output_layers": [["dense_11", 0, 0], ["tf_op_layer_streaming_3/speech_features/data_frame_4/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_1/depthwise_conv1d_24/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_2/depthwise_conv1d_25/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_3/depthwise_conv1d_26/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_4/depthwise_conv1d_27/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_5/depthwise_conv1d_28/concat", 0, 0], ["tf_op_layer_streaming_3/svdf_6/depthwise_conv1d_29/concat", 0, 0], ["tf_op_layer_streaming_3/stream/concat", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}