Model: "E2E_1stage_v5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16000)]           0         
_________________________________________________________________
speech_features (SpeechFeatu (None, 98, 40)            0         
_________________________________________________________________
svdf_1 (Svdf)                (None, 91, 64)            28992     
_________________________________________________________________
svdf_2 (Svdf)                (None, 84, 64)            35136     
_________________________________________________________________
svdf_3 (Svdf)                (None, 77, 64)            35136     
_________________________________________________________________
svdf_4 (Svdf)                (None, 46, 32)            3104      
_________________________________________________________________
svdf_5 (Svdf)                (None, 15, 32)            2080      
_________________________________________________________________
stream (Stream)              (None, 480)               0         
_________________________________________________________________
dropout (Dropout)            (None, 480)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 9)                 4329      
=================================================================
Total params: 108,777
Trainable params: 108,777
Non-trainable params: 0
_________________________________________________________________