{"class_name": "Model", "config": {"name": "keyword_marvin_v4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 48000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "SpeechFeatures", "config": {"name": "speech_features", "trainable": true, "dtype": "float32", "mode": "TRAINING", "use_tf_fft": false, "inference_batch_size": 1, "preemph": 0.0, "window_type": "hann", "frame_size_ms": 30.0, "frame_step_ms": 10.0, "mel_num_bins": 80, "mel_lower_edge_hertz": 20.0, "mel_upper_edge_hertz": 7000, "log_epsilon": 1e-12, "sample_rate": 16000.0, "noise_scale": 0.0, "fft_magnitude_squared": false, "dct_num_features": 40, "mean": null, "stddev": null}, "name": "speech_features", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_1", "trainable": true, "dtype": "float32", "memory_size": 8, "units1": 96, "use_bias1": false, "units2": 32, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_1", "inbound_nodes": [[["speech_features", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["svdf_1", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_2", "trainable": true, "dtype": "float32", "memory_size": 8, "units1": 96, "use_bias1": false, "units2": 32, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_2", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["svdf_2", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_3", "trainable": true, "dtype": "float32", "memory_size": 8, "units1": 96, "use_bias1": false, "units2": 32, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["svdf_3", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_4", "trainable": true, "dtype": "float32", "memory_size": 8, "units1": 96, "use_bias1": false, "units2": 32, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["svdf_4", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_5", "trainable": true, "dtype": "float32", "memory_size": 32, "units1": 32, "use_bias1": false, "units2": -1, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_5", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_6", "trainable": true, "dtype": "float32", "memory_size": 32, "units1": 32, "use_bias1": false, "units2": -1, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_6", "inbound_nodes": [[["svdf_5", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_7", "trainable": true, "dtype": "float32", "memory_size": 32, "units1": 32, "use_bias1": false, "units2": -1, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "TRAINING", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 1}, "name": "svdf_7", "inbound_nodes": [[["svdf_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["svdf_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}