{"class_name": "Model", "config": {"name": "E2E_1stage_v8_vl_0_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 320], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_audio"}, "name": "input_audio", "inbound_nodes": []}, {"class_name": "SpeechFeatures", "config": {"name": "speech_features", "trainable": true, "dtype": "float32", "mode": "STREAM_INTERNAL_STATE_INFERENCE", "use_tf_fft": false, "inference_batch_size": 1, "preemph": 0.0, "window_type": "hann", "frame_size_ms": 40.0, "frame_step_ms": 20.0, "mel_num_bins": 80, "mel_lower_edge_hertz": 20.0, "mel_upper_edge_hertz": 7000, "log_epsilon": 1e-12, "sample_rate": 16000.0, "noise_scale": 0.0, "fft_magnitude_squared": false, "dct_num_features": 40, "mean": null, "stddev": null}, "name": "speech_features", "inbound_nodes": [[["input_audio", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_1", "trainable": true, "dtype": "float32", "memory_size": 4, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_1", "inbound_nodes": [[["speech_features", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_2", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_2", "inbound_nodes": [[["svdf_1", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_3", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_3", "inbound_nodes": [[["svdf_2", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_4", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_4", "inbound_nodes": [[["svdf_3", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_5", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": 128, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_5", "inbound_nodes": [[["svdf_4", 0, 0, {}]]]}, {"class_name": "Svdf", "config": {"name": "svdf_6", "trainable": true, "dtype": "float32", "memory_size": 10, "units1": 256, "use_bias1": false, "units2": -1, "activation": "relu", "use_bias": true, "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "kernel_initializer": "glorot_uniform", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": "zeros", "bias_regularizer": null, "bias_constraint": null, "dropout": 0.0, "pad": 0}, "name": "svdf_6", "inbound_nodes": [[["svdf_5", 0, 0, {}]]]}, {"class_name": "Stream", "config": {"name": "stream", "trainable": true, "dtype": "float32", "inference_batch_size": 1, "mode": "STREAM_INTERNAL_STATE_INFERENCE", "pad_time_dim": false, "cell": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "__passive_serialization__": true}, "state_shape": [1, 1, 256]}, "name": "stream", "inbound_nodes": [[["svdf_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["stream", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_audio", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}