Model: "E2E_1stage_v8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 49, 40)               0         
_________________________________________________________________
svdf_1 (Svdf)                (1, 46, 128)              44416     
_________________________________________________________________
svdf_2 (Svdf)                (1, 37, 128)              68480     
_________________________________________________________________
svdf_3 (Svdf)                (1, 28, 128)              68480     
_________________________________________________________________
svdf_4 (Svdf)                (1, 19, 128)              68480     
_________________________________________________________________
svdf_5 (Svdf)                (1, 10, 128)              68480     
_________________________________________________________________
svdf_6 (Svdf)                (1, 1, 256)               35584     
_________________________________________________________________
stream (Stream)              (1, 256)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 256)                  0         
_________________________________________________________________
dense_11 (Dense)             (1, 16)                   4112      
=================================================================
Total params: 358,032
Trainable params: 358,032
Non-trainable params: 0
_________________________________________________________________