Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 320)]           0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 1, 40)           0           input_audio[0][0]                
__________________________________________________________________________________________________
svdf_1 (Svdf)                   (1, 1, 128)          44416       speech_features[0][0]            
__________________________________________________________________________________________________
svdf_2 (Svdf)                   (1, 1, 128)          68480       svdf_1[0][0]                     
__________________________________________________________________________________________________
svdf_3 (Svdf)                   (1, 1, 128)          68480       svdf_2[0][0]                     
__________________________________________________________________________________________________
svdf_4 (Svdf)                   (1, 1, 128)          68480       svdf_3[0][0]                     
__________________________________________________________________________________________________
svdf_5 (Svdf)                   (1, 1, 128)          68480       svdf_4[0][0]                     
__________________________________________________________________________________________________
svdf_6 (Svdf)                   (1, 1, 256)          35584       svdf_5[0][0]                     
__________________________________________________________________________________________________
stream (Stream)                 (1, 256)             0           svdf_6[0][0]                     
__________________________________________________________________________________________________
data_frame_5input_state (InputL [(1, 640)]           0                                            
__________________________________________________________________________________________________
depthwise_conv1d_30input_state  [(1, 4, 256)]        0                                            
__________________________________________________________________________________________________
lambda_47 (Lambda)              (1, 1, 40)           0           speech_features[0][0]            
__________________________________________________________________________________________________
depthwise_conv1d_31input_state  [(1, 10, 256)]       0                                            
__________________________________________________________________________________________________
lambda_48 (Lambda)              (1, 1, 128)          0           svdf_1[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_32input_state  [(1, 10, 256)]       0                                            
__________________________________________________________________________________________________
lambda_49 (Lambda)              (1, 1, 128)          0           svdf_2[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_33input_state  [(1, 10, 256)]       0                                            
__________________________________________________________________________________________________
lambda_50 (Lambda)              (1, 1, 128)          0           svdf_3[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_34input_state  [(1, 10, 256)]       0                                            
__________________________________________________________________________________________________
lambda_51 (Lambda)              (1, 1, 128)          0           svdf_4[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_35input_state  [(1, 10, 256)]       0                                            
__________________________________________________________________________________________________
lambda_52 (Lambda)              (1, 1, 128)          0           svdf_5[0][0]                     
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 1, 256)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (1, 256)             0           stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming_4/speech_ [(1, 320)]           0           data_frame_5input_state[0][0]    
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_1/ [(1, 3, 256)]        0           depthwise_conv1d_30input_state[0]
__________________________________________________________________________________________________
dense_56 (Dense)                (1, 1, 256)          10240       lambda_47[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_2/ [(1, 9, 256)]        0           depthwise_conv1d_31input_state[0]
__________________________________________________________________________________________________
dense_58 (Dense)                (1, 1, 256)          32768       lambda_48[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_3/ [(1, 9, 256)]        0           depthwise_conv1d_32input_state[0]
__________________________________________________________________________________________________
dense_60 (Dense)                (1, 1, 256)          32768       lambda_49[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_4/ [(1, 9, 256)]        0           depthwise_conv1d_33input_state[0]
__________________________________________________________________________________________________
dense_62 (Dense)                (1, 1, 256)          32768       lambda_50[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_5/ [(1, 9, 256)]        0           depthwise_conv1d_34input_state[0]
__________________________________________________________________________________________________
dense_64 (Dense)                (1, 1, 256)          32768       lambda_51[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_6/ [(1, 9, 256)]        0           depthwise_conv1d_35input_state[0]
__________________________________________________________________________________________________
dense_66 (Dense)                (1, 1, 256)          32768       lambda_52[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/stream/ [(1, 0, 256)]        0           stream/input_state[0][0]         
__________________________________________________________________________________________________
dense_11 (Dense)                (1, 16)              4112        dropout[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming_4/speech_ [(1, 640)]           0           tf_op_layer_streaming_4/speech_fe
                                                                 input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_1/ [(1, 4, 256)]        0           tf_op_layer_streaming_4/svdf_1/de
                                                                 dense_56[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_2/ [(1, 10, 256)]       0           tf_op_layer_streaming_4/svdf_2/de
                                                                 dense_58[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_3/ [(1, 10, 256)]       0           tf_op_layer_streaming_4/svdf_3/de
                                                                 dense_60[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_4/ [(1, 10, 256)]       0           tf_op_layer_streaming_4/svdf_4/de
                                                                 dense_62[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_5/ [(1, 10, 256)]       0           tf_op_layer_streaming_4/svdf_5/de
                                                                 dense_64[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_6/ [(1, 10, 256)]       0           tf_op_layer_streaming_4/svdf_6/de
                                                                 dense_66[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/stream/ [(1, 1, 256)]        0           tf_op_layer_streaming_4/stream/st
                                                                 svdf_6[0][0]                     
==================================================================================================
Total params: 358,032
Trainable params: 358,032
Non-trainable params: 0
__________________________________________________________________________________________________