Model: "E2E_1stage_v5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 98, 40)               0         
_________________________________________________________________
svdf_1 (Svdf)                (1, 91, 64)               28992     
_________________________________________________________________
svdf_2 (Svdf)                (1, 84, 64)               35136     
_________________________________________________________________
svdf_3 (Svdf)                (1, 77, 64)               35136     
_________________________________________________________________
svdf_4 (Svdf)                (1, 46, 32)               3104      
_________________________________________________________________
svdf_5 (Svdf)                (1, 15, 32)               2080      
_________________________________________________________________
stream (Stream)              (1, 480)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 480)                  0         
_________________________________________________________________
dense_8 (Dense)              (1, 9)                    4329      
=================================================================
Total params: 108,777
Trainable params: 108,777
Non-trainable params: 0
_________________________________________________________________