Model: "keyword_marvin_v2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 48000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 298, 40)              0         
_________________________________________________________________
svdf_1 (Svdf)                (1, 298, 32)              10400     
_________________________________________________________________
svdf_2 (Svdf)                (1, 298, 32)              7040      
_________________________________________________________________
svdf_3 (Svdf)                (1, 298, 32)              7040      
_________________________________________________________________
svdf_4 (Svdf)                (1, 298, 32)              2080      
_________________________________________________________________
svdf_5 (Svdf)                (1, 298, 32)              2080      
_________________________________________________________________
dropout (Dropout)            (1, 298, 32)              0         
_________________________________________________________________
dense_8 (Dense)              (1, 298, 1)               33        
=================================================================
Total params: 28,673
Trainable params: 28,673
Non-trainable params: 0
_________________________________________________________________