Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 160)]           0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 1, 40)           0           input_audio[0][0]                
__________________________________________________________________________________________________
svdf_1 (Svdf)                   (1, 1, 64)           28992       speech_features[0][0]            
__________________________________________________________________________________________________
svdf_2 (Svdf)                   (1, 1, 64)           35136       svdf_1[0][0]                     
__________________________________________________________________________________________________
svdf_3 (Svdf)                   (1, 1, 64)           35136       svdf_2[0][0]                     
__________________________________________________________________________________________________
svdf_4 (Svdf)                   (1, 1, 32)           3104        svdf_3[0][0]                     
__________________________________________________________________________________________________
svdf_5 (Svdf)                   (1, 1, 32)           2080        svdf_4[0][0]                     
__________________________________________________________________________________________________
stream (Stream)                 (1, 480)             0           svdf_5[0][0]                     
__________________________________________________________________________________________________
data_frame_5input_state (InputL [(1, 480)]           0                                            
__________________________________________________________________________________________________
depthwise_conv1d_25input_state  [(1, 8, 256)]        0                                            
__________________________________________________________________________________________________
lambda_48 (Lambda)              (1, 1, 40)           0           speech_features[0][0]            
__________________________________________________________________________________________________
depthwise_conv1d_26input_state  [(1, 8, 256)]        0                                            
__________________________________________________________________________________________________
lambda_49 (Lambda)              (1, 1, 64)           0           svdf_1[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_27input_state  [(1, 8, 256)]        0                                            
__________________________________________________________________________________________________
lambda_50 (Lambda)              (1, 1, 64)           0           svdf_2[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_28input_state  [(1, 32, 32)]        0                                            
__________________________________________________________________________________________________
lambda_51 (Lambda)              (1, 1, 64)           0           svdf_3[0][0]                     
__________________________________________________________________________________________________
depthwise_conv1d_29input_state  [(1, 32, 32)]        0                                            
__________________________________________________________________________________________________
lambda_53 (Lambda)              (1, 1, 32)           0           svdf_4[0][0]                     
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 15, 32)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (1, 480)             0           stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming_4/speech_ [(1, 320)]           0           data_frame_5input_state[0][0]    
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_1/ [(1, 7, 256)]        0           depthwise_conv1d_25input_state[0]
__________________________________________________________________________________________________
dense_41 (Dense)                (1, 1, 256)          10240       lambda_48[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_2/ [(1, 7, 256)]        0           depthwise_conv1d_26input_state[0]
__________________________________________________________________________________________________
dense_43 (Dense)                (1, 1, 256)          16384       lambda_49[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_3/ [(1, 7, 256)]        0           depthwise_conv1d_27input_state[0]
__________________________________________________________________________________________________
dense_45 (Dense)                (1, 1, 256)          16384       lambda_50[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_4/ [(1, 31, 32)]        0           depthwise_conv1d_28input_state[0]
__________________________________________________________________________________________________
dense_47 (Dense)                (1, 1, 32)           2048        lambda_51[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_5/ [(1, 31, 32)]        0           depthwise_conv1d_29input_state[0]
__________________________________________________________________________________________________
dense_48 (Dense)                (1, 1, 32)           1024        lambda_53[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_streaming_4/stream/ [(1, 14, 32)]        0           stream/input_state[0][0]         
__________________________________________________________________________________________________
dense_8 (Dense)                 (1, 9)               4329        dropout[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming_4/speech_ [(1, 480)]           0           tf_op_layer_streaming_4/speech_fe
                                                                 input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_1/ [(1, 8, 256)]        0           tf_op_layer_streaming_4/svdf_1/de
                                                                 dense_41[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_2/ [(1, 8, 256)]        0           tf_op_layer_streaming_4/svdf_2/de
                                                                 dense_43[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_3/ [(1, 8, 256)]        0           tf_op_layer_streaming_4/svdf_3/de
                                                                 dense_45[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_4/ [(1, 32, 32)]        0           tf_op_layer_streaming_4/svdf_4/de
                                                                 dense_47[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/svdf_5/ [(1, 32, 32)]        0           tf_op_layer_streaming_4/svdf_5/de
                                                                 dense_48[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming_4/stream/ [(1, 15, 32)]        0           tf_op_layer_streaming_4/stream/st
                                                                 svdf_5[0][0]                     
==================================================================================================
Total params: 108,777
Trainable params: 108,777
Non-trainable params: 0
__________________________________________________________________________________________________